In [15]:
import pandas as pd
import math

In [7]:
data = pd.DataFrame(data={'xi':[0, 1, 2, 3, 4, 5], 'ni': [403, 370, 167, 46, 12, 2]})

In [13]:
data

   xi   ni  xi*ni
0   0  403      0
1   1  370    370
2   2  167    334
3   3   46    138
4   4   12     48
5   5    2     10

In [28]:
x_mean = sum(data['xi']*data['ni'])/sum(data['ni'])
sum_n = sum(data['ni'])

In [29]:
def poisson_law_formula(level: int) -> float:
    return (x_mean**(level)*math.exp(-x_mean)/math.factorial(level)*sum_n)

In [30]:
data['ni_supposed'] = data['xi'].apply(poisson_law_formula)

In [32]:
data

   xi   ni  xi*ni  ni_supposed
0   0  403      0   406.569660
1   1  370    370   365.912694
2   2  167    334   164.660712
3   3   46    138    49.398214
4   4   12     48    11.114598
5   5    2     10     2.000628

In [35]:
data['dif'] = (data['ni_supposed']-data['ni'])**2/data['ni_supposed']

In [37]:
xi_2 = sum(data['dif'])

In [38]:
xi_2

0.4145339879935705

По таблице находим xi_2 табличный = 7.81 (так как альфа = 0.05, а число степеней свободы = 3).
Таким образом xi_2 экспериментальный < xi_2 табличный, а следовательно гипотеза о распределении случайной величины по закону Пуассона не отвергается.